# ONLINE REASONS

In [1]:
#There are a lot of reasons to choose pandas, some of them are

# Open Source
# Easy to Learn
# Great Community
# Built on Top of Numpy
# Easy to Analyze and pre-process data in it
# Built-in Data Visualization
# A lot of Built-in functions to help in Exploratory Data Analysis
# Built-in support for CSV, SQL, HTML, JSON, pickle, excel, clipboard and a lot more
# and a lot more

In [2]:
# #Pandas is an open source Python library that allows the handling of tabular data (i.e. explore, clean and process). 
# The term originated from the econometrics term panel data and thus 
# PAN(el)-DA(ta)-S.

# # At a high-level, Pandas works very much like a spreadsheet 
# (i.e. think Microsoft Excel or Google Sheets) as you work with rows and columns. 
# Pandas serves as one of the pillar libraries of any data science workflow as it allows you to perform processing, 
# wrangling and munging of data. This is particularly important as many consider the data pre-processing stage 
# to occupy as much as 80% of a data scientistâ€™s time.

In [3]:
#  The two primary data structures are Series which is 1 dimensional and DataFrame which is 2 dimensional.

In [4]:
# SYLLABUS HOSE UDEMY

In [5]:
# Series
# DataFrames
# Missing Data
# GroupBy
# Merging,Joining,and Concatenating
# Operations
# Data Input and Output

# Series

In [6]:
# built on top of numpy array
#  can be accesed by lables

In [7]:
import numpy as np
import pandas as pd

In [8]:
labels = ['a','b','c']
mydata = [10,20,30]
arr =  np.array(mydata)
d  = {'a':10,'b':20,'c':30}

In [9]:
# creating a series
pd.Series(data=mydata)

0    10
1    20
2    30
dtype: int64

In [10]:
#changing default labels to our custom labels
pd.Series(data=mydata,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
# creating a series using array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
# creating a series using dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
# accesing the data using index
s1 = pd.Series([1,2,3,4,],['usa','ger','ussr','japan'])
s2 = pd.Series([1,2,3,4,],['usa','ger','italy','japan'])

In [14]:
print(s1,s2)

usa      1
ger      2
ussr     3
japan    4
dtype: int64 usa      1
ger      2
italy    3
japan    4
dtype: int64

In [15]:
s1['usa']

1

In [16]:
s2['italy']

3

In [17]:
# s2['ussr'] #KeyError

In [18]:
s1+s2

ger      4.0
italy    NaN
japan    8.0
usa      2.0
ussr     NaN
dtype: float64

# DATAFrames

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101)

In [21]:
df  =  pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
df.shape

(5, 4)

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# accessing the data in the df
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [26]:
df['W':'Z']

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [27]:
# creating a new column
df['new1'] = df['W'] + df['W']

In [28]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  5.413700
B  0.651118 -0.319318 -0.848077  0.605965  1.302236
C -2.018168  0.740122  0.528813 -0.589001 -4.036336
D  0.188695 -0.758872 -0.933237  0.955057  0.377391
E  0.190794  1.978757  2.605967  0.683509  0.381589

In [29]:
# dropping a column
df.drop('new1',axis=1) #not effective only view

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  5.413700
B  0.651118 -0.319318 -0.848077  0.605965  1.302236
C -2.018168  0.740122  0.528813 -0.589001 -4.036336
D  0.188695 -0.758872 -0.933237  0.955057  0.377391
E  0.190794  1.978757  2.605967  0.683509  0.381589

In [31]:
# dropping a column
df.drop('new1',axis=1,inplace=True) #  effective now, permanently

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
# dropping a row
df.drop('E') # axis= 0 is by default

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [34]:
# Selectin rows

In [35]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [36]:
# index based 
# for accessing row 'C'
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [37]:
# subsets of rows and columns

In [38]:
df.loc['B','Y']

-0.8480769834036315

In [39]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [40]:
# practice

# arr1 = np.arange(20).reshape(5,4)
# df  =  pd.DataFrame(arr1,['A','B','C','D','E'],['W','X','Y','Z'])

In [41]:
# df

# Conditional Selection

In [42]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
booldf = df > 0

In [44]:
df[booldf] #NaN for False values
# Single step
#  df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df['W'] >0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [46]:
df[df['W'] >0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['Z'] <0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
# extracting data from the conditional selection
# Selecting col X from the conditional selection
df[df['W'] >0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [49]:
df[df['W'] >0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [50]:
# Passing multiple conditions
df[(df['W'] >0) & (df['Y'] >1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df[(df['W'] >0) | (df['Y'] >1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
# resetting index to default
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [53]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
# setting index

In [55]:
newindex = ['P', 'Q', 'R', 'S', 'T']

In [56]:
newindex

['P', 'Q', 'R', 'S', 'T']

In [57]:
df['States'] = newindex

In [58]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826      P
B  0.651118 -0.319318 -0.848077  0.605965      Q
C -2.018168  0.740122  0.528813 -0.589001      R
D  0.188695 -0.758872 -0.933237  0.955057      S
E  0.190794  1.978757  2.605967  0.683509      T

In [59]:
# maing the new column as INDEX
df.set_index('States')

               W         X         Y         Z
States
P       2.706850  0.628133  0.907969  0.503826
Q       0.651118 -0.319318 -0.848077  0.605965
R      -2.018168  0.740122  0.528813 -0.589001
S       0.188695 -0.758872 -0.933237  0.955057
T       0.190794  1.978757  2.605967  0.683509

# Multi Index

In [60]:
# advanced topic for later

In [1]:
import numpy as np
import pandas as pd

# Missing data

In [2]:
d = {'A' : [1,2,np.nan],
    'B' : [1,np.nan,np.nan],
    'C' : [1,2,3],}

In [3]:
df = pd.DataFrame(d)

In [5]:
print(df)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [6]:
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
# removing na from the goven dataset

In [8]:
df.dropna() # default axis = 0

     A    B  C
0  1.0  1.0  1

In [9]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2) # setting a threshold for preserving the row/coluumn

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [11]:
# filling missing values

In [12]:
df.fillna(value="SOME DATA")

           A          B  C
0        1.0        1.0  1
1        2.0  SOME DATA  2
2  SOME DATA  SOME DATA  3

In [15]:
df['A'].fillna(value=df['A'].mean()) # filing the missing data with measn value

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [45]:
np.array(list("goog goog msft msft fb fb sam char amy vnaess carl Sara 200 12 340 124 243 350".split(" "))).reshape(3,6)

array([['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
       ['sam', 'char', 'amy', 'vnaess', 'carl', 'Sara'],
       ['200', '12', '340', '124', '243', '350']], dtype='<U6')

In [51]:
# same concept as sql

In [52]:
df  =  pd.DataFrame(np.array(list("goog goog msft msft fb fb sam char amy vnaess carl Sara 200 12 340 124 243 350".split(" "))).reshape(3,6),list(range(0,3)),list('ABCDEF'))

In [53]:
df

      A     B     C       D     E     F
0  goog  goog  msft    msft    fb    fb
1   sam  char   amy  vnaess  carl  Sara
2   200    12   340     124   243   350

In [57]:
data = {'Company' : ['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
        'Person' :     ['sam', 'char', 'amy', 'vnaess', 'carl', 'Sara'],
        'sales' : ['200', '120', '340', '124', '243', '350']
    
}

In [58]:
df  = pd.DataFrame(data)

In [59]:
df

  Company  Person sales
0    goog     sam   200
1    goog    char   120
2    msft     amy   340
3    msft  vnaess   124
4      fb    carl   243
5      fb    Sara   350

In [61]:
df.groupby('Company')

In [62]:
by_comp = df.groupby('Company')

In [63]:
by_comp.mean()

C:\Users\RAHUL\AppData\Local\Temp\ipykernel_20236\821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

            sales
Company
fb       121675.0
goog     100060.0
msft     170062.0

In [64]:
by_comp.sum()

            Person   sales
Company
fb        carlSara  243350
goog       samchar  200120
msft     amyvnaess  340124

In [65]:
# all in one liner
df.groupby('Company').sum().loc['fb']

Person    carlSara
sales       243350
Name: fb, dtype: object

In [66]:
df.groupby('Company').count()

         Person  sales
Company
fb            2      2
goog          2      2
msft          2      2

In [67]:
df.groupby('Company').max()

         Person sales
Company
fb         carl   350
goog        sam   200
msft     vnaess   340

In [68]:
df.groupby('Company').min()

        Person sales
Company
fb        Sara   243
goog      char   120
msft       amy   124

In [69]:
df.groupby('Company').describe()

        Person                   sales
         count unique   top freq count unique  top freq
Company
fb           2      2  carl    1     2      2  243    1
goog         2      2   sam    1     2      2  200    1
msft         2      2   amy    1     2      2  340    1

In [70]:
df.groupby('Company').describe().transpose()

Company          fb goog msft
Person count      2    2    2
       unique     2    2    2
       top     carl  sam  amy
       freq       1    1    1
sales  count      2    2    2
       unique     2    2    2
       top      243  200  340
       freq       1    1    1

In [71]:
df.groupby('Company').describe().transpose()['fb']

Person  count        2
        unique       2
        top       carl
        freq         1
sales   count        2
        unique       2
        top        243
        freq         1
Name: fb, dtype: object

# Concatenating

In [72]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [73]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [81]:

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [76]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [77]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [82]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [85]:
pd.concat([df1,df2,df3]) #default axis=0 for concat

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [86]:
# We will be mostly joining along axis=1
pd.concat([df1,df2,df3] , axis=1) #changing default axis=0 for concat to axis=1

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging

In [87]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [89]:
pd.concat([left,right], axis=1)

  key   A   B key   C   D
0  K0  A0  B0  K0  C0  D0
1  K1  A1  B1  K1  C1  D1
2  K2  A2  B2  K2  C2  D2
3  K3  A3  B3  K3  C3  D3

In [97]:
# pd.merge(left,right,how='outer',on='key')

In [92]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [93]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [98]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [99]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [94]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [95]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Joininng

In [100]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [101]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [102]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [104]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [105]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3